Dealtime/users-roles-publisher-xmls/AddSellersRoles.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://service.ws.um.carbon.wso2.org"
                  xmlns:xsd="http://dao.service.ws.um.carbon.wso2.org/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:addRole>

            <ser:roleName>seller</ser:roleName>
            <ser:permissions>
                <xsd:action>ui.execute</xsd:action>
                <xsd:resourceId>/permission/admin/login</xsd:resourceId>
            </ser:permissions>
        </ser:addRole>

    </soapenv:Body>
</soapenv:Envelope>
